app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = $1  [["user_id", 1]]
---
  def index
    @products = current_user.products.paginate(page: params[:page], per_page: 10)

INSERT INTO "products" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "rahul pal"], ["description", "demo des"], ["price", 12.34], ["user_id", 1], ["created_at", "2024-04-21 08:38:35.499530"], ["updated_at", "2024-04-21 08:38:35.499530"]]
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user

    respond_to do |format|
      if @product.save

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", 12.3412], ["updated_at", "2024-04-27 17:12:21.159799"], ["id", 21]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)